Revit 2024 API
BuiltInFailures.EditingFailures.UnableToTransformElementError Property
 Attempted an invalid element rotate, mirror, or move.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToTransformElementError { get; }
Visual Basic
Public Shared ReadOnly Property UnableToTransformElementError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToTransformElementError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace